[27.02.2018 20:02:44] Model summary:
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] Layer (type)                    Output Shape         Param #     Ops #     Connected to           
[27.02.2018 20:02:44] ==================================================================================================
[27.02.2018 20:02:44] input_1 (InputLayer)            (None, 224, 224, 3)  0           None                             
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv1 (Conv2D)                  (None, 112, 112, 24) 648         8128512   input_1[0][0]          
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv1_bn (BatchNormalization)   (None, 112, 112, 24) 96          None      conv1[0][0]            
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv1_relu (Activation)         (None, 112, 112, 24) 0           None      conv1_bn[0][0]         
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_1 (DepthwiseConv2D)     (None, 112, 112, 24) 216         None      conv1_relu[0][0]       
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_1_bn (BatchNormalizatio (None, 112, 112, 24) 96          None      conv_dw_1[0][0]        
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_1_relu (Activation)     (None, 112, 112, 24) 0           None      conv_dw_1_bn[0][0]     
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_1 (Conv2D)              (None, 112, 112, 48) 1152        14450688  conv_dw_1_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_1_bn (BatchNormalizatio (None, 112, 112, 48) 192         None      conv_pw_1[0][0]        
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_1_relu (Activation)     (None, 112, 112, 48) 0           None      conv_pw_1_bn[0][0]     
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_2 (DepthwiseConv2D)     (None, 56, 56, 48)   432         None      conv_pw_1_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_2_bn (BatchNormalizatio (None, 56, 56, 48)   192         None      conv_dw_2[0][0]        
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_2_relu (Activation)     (None, 56, 56, 48)   0           None      conv_dw_2_bn[0][0]     
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_2 (Conv2D)              (None, 56, 56, 96)   4608        14450688  conv_dw_2_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_2_bn (BatchNormalizatio (None, 56, 56, 96)   384         None      conv_pw_2[0][0]        
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_2_relu (Activation)     (None, 56, 56, 96)   0           None      conv_pw_2_bn[0][0]     
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_3 (DepthwiseConv2D)     (None, 56, 56, 96)   864         None      conv_pw_2_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_3_bn (BatchNormalizatio (None, 56, 56, 96)   384         None      conv_dw_3[0][0]        
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_3_relu (Activation)     (None, 56, 56, 96)   0           None      conv_dw_3_bn[0][0]     
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_3 (Conv2D)              (None, 56, 56, 96)   9216        28901376  conv_dw_3_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_3_bn (BatchNormalizatio (None, 56, 56, 96)   384         None      conv_pw_3[0][0]        
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_3_relu (Activation)     (None, 56, 56, 96)   0           None      conv_pw_3_bn[0][0]     
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_4 (DepthwiseConv2D)     (None, 28, 28, 96)   864         None      conv_pw_3_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_4_bn (BatchNormalizatio (None, 28, 28, 96)   384         None      conv_dw_4[0][0]        
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_4_relu (Activation)     (None, 28, 28, 96)   0           None      conv_dw_4_bn[0][0]     
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_4 (Conv2D)              (None, 28, 28, 192)  18432       14450688  conv_dw_4_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_4_bn (BatchNormalizatio (None, 28, 28, 192)  768         None      conv_pw_4[0][0]        
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_4_relu (Activation)     (None, 28, 28, 192)  0           None      conv_pw_4_bn[0][0]     
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_5 (DepthwiseConv2D)     (None, 28, 28, 192)  1728        None      conv_pw_4_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_5_bn (BatchNormalizatio (None, 28, 28, 192)  768         None      conv_dw_5[0][0]        
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_5_relu (Activation)     (None, 28, 28, 192)  0           None      conv_dw_5_bn[0][0]     
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_5 (Conv2D)              (None, 28, 28, 192)  36864       28901376  conv_dw_5_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_5_bn (BatchNormalizatio (None, 28, 28, 192)  768         None      conv_pw_5[0][0]        
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_5_relu (Activation)     (None, 28, 28, 192)  0           None      conv_pw_5_bn[0][0]     
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_6 (DepthwiseConv2D)     (None, 14, 14, 192)  1728        None      conv_pw_5_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_6_bn (BatchNormalizatio (None, 14, 14, 192)  768         None      conv_dw_6[0][0]        
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_6_relu (Activation)     (None, 14, 14, 192)  0           None      conv_dw_6_bn[0][0]     
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_6 (Conv2D)              (None, 14, 14, 384)  73728       14450688  conv_dw_6_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_6_bn (BatchNormalizatio (None, 14, 14, 384)  1536        None      conv_pw_6[0][0]        
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_6_relu (Activation)     (None, 14, 14, 384)  0           None      conv_pw_6_bn[0][0]     
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_7 (DepthwiseConv2D)     (None, 14, 14, 384)  3456        None      conv_pw_6_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_7_bn (BatchNormalizatio (None, 14, 14, 384)  1536        None      conv_dw_7[0][0]        
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_7_relu (Activation)     (None, 14, 14, 384)  0           None      conv_dw_7_bn[0][0]     
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_7 (Conv2D)              (None, 14, 14, 384)  147456      28901376  conv_dw_7_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_7_bn (BatchNormalizatio (None, 14, 14, 384)  1536        None      conv_pw_7[0][0]        
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_7_relu (Activation)     (None, 14, 14, 384)  0           None      conv_pw_7_bn[0][0]     
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_8 (DepthwiseConv2D)     (None, 14, 14, 384)  3456        None      conv_pw_7_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_8_bn (BatchNormalizatio (None, 14, 14, 384)  1536        None      conv_dw_8[0][0]        
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_8_relu (Activation)     (None, 14, 14, 384)  0           None      conv_dw_8_bn[0][0]     
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_8 (Conv2D)              (None, 14, 14, 384)  147456      28901376  conv_dw_8_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_8_bn (BatchNormalizatio (None, 14, 14, 384)  1536        None      conv_pw_8[0][0]        
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_8_relu (Activation)     (None, 14, 14, 384)  0           None      conv_pw_8_bn[0][0]     
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_9 (DepthwiseConv2D)     (None, 14, 14, 384)  3456        None      conv_pw_8_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_9_bn (BatchNormalizatio (None, 14, 14, 384)  1536        None      conv_dw_9[0][0]        
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_9_relu (Activation)     (None, 14, 14, 384)  0           None      conv_dw_9_bn[0][0]     
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_9 (Conv2D)              (None, 14, 14, 384)  147456      28901376  conv_dw_9_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_9_bn (BatchNormalizatio (None, 14, 14, 384)  1536        None      conv_pw_9[0][0]        
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_9_relu (Activation)     (None, 14, 14, 384)  0           None      conv_pw_9_bn[0][0]     
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_10 (DepthwiseConv2D)    (None, 14, 14, 384)  3456        None      conv_pw_9_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_10_bn (BatchNormalizati (None, 14, 14, 384)  1536        None      conv_dw_10[0][0]       
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_10_relu (Activation)    (None, 14, 14, 384)  0           None      conv_dw_10_bn[0][0]    
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_10 (Conv2D)             (None, 14, 14, 384)  147456      28901376  conv_dw_10_relu[0][0]  
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_10_bn (BatchNormalizati (None, 14, 14, 384)  1536        None      conv_pw_10[0][0]       
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_10_relu (Activation)    (None, 14, 14, 384)  0           None      conv_pw_10_bn[0][0]    
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_11 (DepthwiseConv2D)    (None, 14, 14, 384)  3456        None      conv_pw_10_relu[0][0]  
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_11_bn (BatchNormalizati (None, 14, 14, 384)  1536        None      conv_dw_11[0][0]       
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_11_relu (Activation)    (None, 14, 14, 384)  0           None      conv_dw_11_bn[0][0]    
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_11 (Conv2D)             (None, 14, 14, 384)  147456      28901376  conv_dw_11_relu[0][0]  
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_11_bn (BatchNormalizati (None, 14, 14, 384)  1536        None      conv_pw_11[0][0]       
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_11_relu (Activation)    (None, 14, 14, 384)  0           None      conv_pw_11_bn[0][0]    
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_12 (DepthwiseConv2D)    (None, 7, 7, 384)    3456        None      conv_pw_11_relu[0][0]  
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_12_bn (BatchNormalizati (None, 7, 7, 384)    1536        None      conv_dw_12[0][0]       
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_12_relu (Activation)    (None, 7, 7, 384)    0           None      conv_dw_12_bn[0][0]    
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_12 (Conv2D)             (None, 7, 7, 768)    294912      14450688  conv_dw_12_relu[0][0]  
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_12_bn (BatchNormalizati (None, 7, 7, 768)    3072        None      conv_pw_12[0][0]       
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_12_relu (Activation)    (None, 7, 7, 768)    0           None      conv_pw_12_bn[0][0]    
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_13 (DepthwiseConv2D)    (None, 7, 7, 768)    6912        None      conv_pw_12_relu[0][0]  
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_13_bn (BatchNormalizati (None, 7, 7, 768)    3072        None      conv_dw_13[0][0]       
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_dw_13_relu (Activation)    (None, 7, 7, 768)    0           None      conv_dw_13_bn[0][0]    
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_13 (Conv2D)             (None, 7, 7, 768)    589824      28901376  conv_dw_13_relu[0][0]  
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_13_bn (BatchNormalizati (None, 7, 7, 768)    3072        None      conv_pw_13[0][0]       
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] conv_pw_13_relu (Activation)    (None, 7, 7, 768)    0           None      conv_pw_13_bn[0][0]    
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] global_average_pooling2d_1 (Glo (None, 48)           0           None      conv_pw_1_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] global_average_pooling2d_2 (Glo (None, 96)           0           None      conv_pw_2_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] global_average_pooling2d_3 (Glo (None, 96)           0           None      conv_pw_3_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] global_average_pooling2d_4 (Glo (None, 192)          0           None      conv_pw_4_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] global_average_pooling2d_5 (Glo (None, 192)          0           None      conv_pw_5_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] global_average_pooling2d_6 (Glo (None, 384)          0           None      conv_pw_6_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] global_average_pooling2d_7 (Glo (None, 384)          0           None      conv_pw_7_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] global_average_pooling2d_8 (Glo (None, 384)          0           None      conv_pw_8_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] global_average_pooling2d_9 (Glo (None, 384)          0           None      conv_pw_9_relu[0][0]   
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] global_average_pooling2d_10 (Gl (None, 384)          0           None      conv_pw_10_relu[0][0]  
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] global_average_pooling2d_11 (Gl (None, 384)          0           None      conv_pw_11_relu[0][0]  
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] global_average_pooling2d_12 (Gl (None, 768)          0           None      conv_pw_12_relu[0][0]  
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] global_average_pooling2d_13 (Gl (None, 768)          0           None      conv_pw_13_relu[0][0]  
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] flatten_1 (Flatten)             (None, 37632)        0           None      conv_pw_13_relu[0][0]  
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] intermediate_conv_pw_1_relu (De (None, 101)          4949        4848      global_average_pooling2
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] intermediate_conv_pw_2_relu (De (None, 101)          9797        9696      global_average_pooling2
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] intermediate_conv_pw_3_relu (De (None, 101)          9797        9696      global_average_pooling2
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] intermediate_conv_pw_4_relu (De (None, 101)          19493       19392     global_average_pooling2
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] intermediate_conv_pw_5_relu (De (None, 101)          19493       19392     global_average_pooling2
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] intermediate_conv_pw_6_relu (De (None, 101)          38885       38784     global_average_pooling2
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] intermediate_conv_pw_7_relu (De (None, 101)          38885       38784     global_average_pooling2
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] intermediate_conv_pw_8_relu (De (None, 101)          38885       38784     global_average_pooling2
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] intermediate_conv_pw_9_relu (De (None, 101)          38885       38784     global_average_pooling2
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] intermediate_conv_pw_10_relu (D (None, 101)          38885       38784     global_average_pooling2
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] intermediate_conv_pw_11_relu (D (None, 101)          38885       38784     global_average_pooling2
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] intermediate_conv_pw_12_relu (D (None, 101)          77669       77568     global_average_pooling2
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] intermediate_conv_pw_13_relu (D (None, 101)          77669       77568     global_average_pooling2
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] final_output (Dense)            (None, 101)          3800933     3800832   flatten_1[0][0]        
[27.02.2018 20:02:44] ==================================================================================================
[27.02.2018 20:02:44] Total params: 6,086,086
[27.02.2018 20:02:44] Trainable params: 4,253,110
[27.02.2018 20:02:44] Non-trainable params: 1,832,976
[27.02.2018 20:02:44] Total floating point operations: 315,844,656
[27.02.2018 20:02:44] __________________________________________________________________________________________________
[27.02.2018 20:02:44] 

