[18.02.2018 17:04:10] Model summary:
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] Layer (type)                    Output Shape         Param #     Ops #     Connected to           
[18.02.2018 17:04:10] ==================================================================================================
[18.02.2018 17:04:10] input_1 (InputLayer)            (None, 224, 224, 3)  0           None                             
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv1 (Conv2D)                  (None, 112, 112, 8)  216         2709504   input_1[0][0]          
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv1_bn (BatchNormalization)   (None, 112, 112, 8)  32          None      conv1[0][0]            
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv1_relu (Activation)         (None, 112, 112, 8)  0           None      conv1_bn[0][0]         
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_1 (DepthwiseConv2D)     (None, 112, 112, 8)  72          None      conv1_relu[0][0]       
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_1_bn (BatchNormalizatio (None, 112, 112, 8)  32          None      conv_dw_1[0][0]        
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_1_relu (Activation)     (None, 112, 112, 8)  0           None      conv_dw_1_bn[0][0]     
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_1 (Conv2D)              (None, 112, 112, 16) 128         1605632   conv_dw_1_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_1_bn (BatchNormalizatio (None, 112, 112, 16) 64          None      conv_pw_1[0][0]        
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_1_relu (Activation)     (None, 112, 112, 16) 0           None      conv_pw_1_bn[0][0]     
[18.02.2018 17:04:10] __________________________________________________________________________________________________


[18.02.2018 17:04:10] conv_dw_2 (DepthwiseConv2D)     (None, 56, 56, 16)   144         None      conv_pw_1_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_2_bn (BatchNormalizatio (None, 56, 56, 16)   64          None      conv_dw_2[0][0]        
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_2_relu (Activation)     (None, 56, 56, 16)   0           None      conv_dw_2_bn[0][0]     
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_2 (Conv2D)              (None, 56, 56, 32)   512         1605632   conv_dw_2_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_2_bn (BatchNormalizatio (None, 56, 56, 32)   128         None      conv_pw_2[0][0]        
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_2_relu (Activation)     (None, 56, 56, 32)   0           None      conv_pw_2_bn[0][0]     
[18.02.2018 17:04:10] __________________________________________________________________________________________________


[18.02.2018 17:04:10] conv_dw_3 (DepthwiseConv2D)     (None, 56, 56, 32)   288         None      conv_pw_2_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_3_bn (BatchNormalizatio (None, 56, 56, 32)   128         None      conv_dw_3[0][0]        
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_3_relu (Activation)     (None, 56, 56, 32)   0           None      conv_dw_3_bn[0][0]     
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_3 (Conv2D)              (None, 56, 56, 32)   1024        3211264   conv_dw_3_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_3_bn (BatchNormalizatio (None, 56, 56, 32)   128         None      conv_pw_3[0][0]        
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_3_relu (Activation)     (None, 56, 56, 32)   0           None      conv_pw_3_bn[0][0]     
[18.02.2018 17:04:10] __________________________________________________________________________________________________


[18.02.2018 17:04:10] conv_dw_4 (DepthwiseConv2D)     (None, 28, 28, 32)   288         None      conv_pw_3_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_4_bn (BatchNormalizatio (None, 28, 28, 32)   128         None      conv_dw_4[0][0]        
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_4_relu (Activation)     (None, 28, 28, 32)   0           None      conv_dw_4_bn[0][0]     
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_4 (Conv2D)              (None, 28, 28, 64)   2048        1605632   conv_dw_4_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_4_bn (BatchNormalizatio (None, 28, 28, 64)   256         None      conv_pw_4[0][0]        
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_4_relu (Activation)     (None, 28, 28, 64)   0           None      conv_pw_4_bn[0][0]     
[18.02.2018 17:04:10] __________________________________________________________________________________________________


[18.02.2018 17:04:10] conv_dw_5 (DepthwiseConv2D)     (None, 28, 28, 64)   576         None      conv_pw_4_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_5_bn (BatchNormalizatio (None, 28, 28, 64)   256         None      conv_dw_5[0][0]        
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_5_relu (Activation)     (None, 28, 28, 64)   0           None      conv_dw_5_bn[0][0]     
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_5 (Conv2D)              (None, 28, 28, 64)   4096        3211264   conv_dw_5_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_5_bn (BatchNormalizatio (None, 28, 28, 64)   256         None      conv_pw_5[0][0]        
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_5_relu (Activation)     (None, 28, 28, 64)   0           None      conv_pw_5_bn[0][0]     
[18.02.2018 17:04:10] __________________________________________________________________________________________________


[18.02.2018 17:04:10] conv_dw_6 (DepthwiseConv2D)     (None, 14, 14, 64)   576         None      conv_pw_5_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_6_bn (BatchNormalizatio (None, 14, 14, 64)   256         None      conv_dw_6[0][0]        
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_6_relu (Activation)     (None, 14, 14, 64)   0           None      conv_dw_6_bn[0][0]     
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_6 (Conv2D)              (None, 14, 14, 128)  8192        1605632   conv_dw_6_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_6_bn (BatchNormalizatio (None, 14, 14, 128)  512         None      conv_pw_6[0][0]        
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_6_relu (Activation)     (None, 14, 14, 128)  0           None      conv_pw_6_bn[0][0]     
[18.02.2018 17:04:10] __________________________________________________________________________________________________


[18.02.2018 17:04:10] conv_dw_7 (DepthwiseConv2D)     (None, 14, 14, 128)  1152        None      conv_pw_6_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_7_bn (BatchNormalizatio (None, 14, 14, 128)  512         None      conv_dw_7[0][0]        
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_7_relu (Activation)     (None, 14, 14, 128)  0           None      conv_dw_7_bn[0][0]     
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_7 (Conv2D)              (None, 14, 14, 128)  16384       3211264   conv_dw_7_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_7_bn (BatchNormalizatio (None, 14, 14, 128)  512         None      conv_pw_7[0][0]        
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_7_relu (Activation)     (None, 14, 14, 128)  0           None      conv_pw_7_bn[0][0]     
[18.02.2018 17:04:10] __________________________________________________________________________________________________


[18.02.2018 17:04:10] conv_dw_8 (DepthwiseConv2D)     (None, 14, 14, 128)  1152        None      conv_pw_7_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_8_bn (BatchNormalizatio (None, 14, 14, 128)  512         None      conv_dw_8[0][0]        
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_8_relu (Activation)     (None, 14, 14, 128)  0           None      conv_dw_8_bn[0][0]     
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_8 (Conv2D)              (None, 14, 14, 128)  16384       3211264   conv_dw_8_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_8_bn (BatchNormalizatio (None, 14, 14, 128)  512         None      conv_pw_8[0][0]        
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_8_relu (Activation)     (None, 14, 14, 128)  0           None      conv_pw_8_bn[0][0]     
[18.02.2018 17:04:10] __________________________________________________________________________________________________



[18.02.2018 17:04:10] conv_dw_9 (DepthwiseConv2D)     (None, 14, 14, 128)  1152        None      conv_pw_8_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_9_bn (BatchNormalizatio (None, 14, 14, 128)  512         None      conv_dw_9[0][0]        
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_9_relu (Activation)     (None, 14, 14, 128)  0           None      conv_dw_9_bn[0][0]     
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_9 (Conv2D)              (None, 14, 14, 128)  16384       3211264   conv_dw_9_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_9_bn (BatchNormalizatio (None, 14, 14, 128)  512         None      conv_pw_9[0][0]        
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_9_relu (Activation)     (None, 14, 14, 128)  0           None      conv_pw_9_bn[0][0]     
[18.02.2018 17:04:10] __________________________________________________________________________________________________


[18.02.2018 17:04:10] conv_dw_10 (DepthwiseConv2D)    (None, 14, 14, 128)  1152        None      conv_pw_9_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_10_bn (BatchNormalizati (None, 14, 14, 128)  512         None      conv_dw_10[0][0]       
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_10_relu (Activation)    (None, 14, 14, 128)  0           None      conv_dw_10_bn[0][0]    
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_10 (Conv2D)             (None, 14, 14, 128)  16384       3211264   conv_dw_10_relu[0][0]  
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_10_bn (BatchNormalizati (None, 14, 14, 128)  512         None      conv_pw_10[0][0]       
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_10_relu (Activation)    (None, 14, 14, 128)  0           None      conv_pw_10_bn[0][0]    
[18.02.2018 17:04:10] __________________________________________________________________________________________________


[18.02.2018 17:04:10] conv_dw_11 (DepthwiseConv2D)    (None, 14, 14, 128)  1152        None      conv_pw_10_relu[0][0]  
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_11_bn (BatchNormalizati (None, 14, 14, 128)  512         None      conv_dw_11[0][0]       
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_11_relu (Activation)    (None, 14, 14, 128)  0           None      conv_dw_11_bn[0][0]    
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_11 (Conv2D)             (None, 14, 14, 128)  16384       3211264   conv_dw_11_relu[0][0]  
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_11_bn (BatchNormalizati (None, 14, 14, 128)  512         None      conv_pw_11[0][0]       
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_11_relu (Activation)    (None, 14, 14, 128)  0           None      conv_pw_11_bn[0][0]    
[18.02.2018 17:04:10] __________________________________________________________________________________________________



[18.02.2018 17:04:10] conv_dw_12 (DepthwiseConv2D)    (None, 7, 7, 128)    1152        None      conv_pw_11_relu[0][0]  
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_12_bn (BatchNormalizati (None, 7, 7, 128)    512         None      conv_dw_12[0][0]       
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_12_relu (Activation)    (None, 7, 7, 128)    0           None      conv_dw_12_bn[0][0]    
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_12 (Conv2D)             (None, 7, 7, 256)    32768       1605632   conv_dw_12_relu[0][0]  
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_12_bn (BatchNormalizati (None, 7, 7, 256)    1024        None      conv_pw_12[0][0]       
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_12_relu (Activation)    (None, 7, 7, 256)    0           None      conv_pw_12_bn[0][0]    
[18.02.2018 17:04:10] __________________________________________________________________________________________________

[18.02.2018 17:04:10] conv_dw_13 (DepthwiseConv2D)    (None, 7, 7, 256)    2304        None      conv_pw_12_relu[0][0]  
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_13_bn (BatchNormalizati (None, 7, 7, 256)    1024        None      conv_dw_13[0][0]       
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_dw_13_relu (Activation)    (None, 7, 7, 256)    0           None      conv_dw_13_bn[0][0]    
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_13 (Conv2D)             (None, 7, 7, 256)    65536       3211264   conv_dw_13_relu[0][0]  
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_13_bn (BatchNormalizati (None, 7, 7, 256)    1024        None      conv_pw_13[0][0]       
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] conv_pw_13_relu (Activation)    (None, 7, 7, 256)    0           None      conv_pw_13_bn[0][0]    
[18.02.2018 17:04:10] __________________________________________________________________________________________________


[18.02.2018 17:04:10] global_average_pooling2d_1 (Glo (None, 16)           0           None      conv_pw_1_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] global_average_pooling2d_2 (Glo (None, 32)           0           None      conv_pw_2_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] global_average_pooling2d_3 (Glo (None, 32)           0           None      conv_pw_3_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] global_average_pooling2d_4 (Glo (None, 64)           0           None      conv_pw_4_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] global_average_pooling2d_5 (Glo (None, 64)           0           None      conv_pw_5_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] global_average_pooling2d_6 (Glo (None, 128)          0           None      conv_pw_6_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] global_average_pooling2d_7 (Glo (None, 128)          0           None      conv_pw_7_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] global_average_pooling2d_8 (Glo (None, 128)          0           None      conv_pw_8_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] global_average_pooling2d_9 (Glo (None, 128)          0           None      conv_pw_9_relu[0][0]   
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] global_average_pooling2d_10 (Gl (None, 128)          0           None      conv_pw_10_relu[0][0]  
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] global_average_pooling2d_11 (Gl (None, 128)          0           None      conv_pw_11_relu[0][0]  
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] global_average_pooling2d_12 (Gl (None, 256)          0           None      conv_pw_12_relu[0][0]  
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] global_average_pooling2d_13 (Gl (None, 256)          0           None      conv_pw_13_relu[0][0]  
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] flatten_1 (Flatten)             (None, 12544)        0           None      conv_pw_13_relu[0][0]  
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] intermediate_conv_pw_1_relu (De (None, 101)          1717        1616      global_average_pooling2
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] intermediate_conv_pw_2_relu (De (None, 101)          3333        3232      global_average_pooling2
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] intermediate_conv_pw_3_relu (De (None, 101)          3333        3232      global_average_pooling2
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] intermediate_conv_pw_4_relu (De (None, 101)          6565        6464      global_average_pooling2
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] intermediate_conv_pw_5_relu (De (None, 101)          6565        6464      global_average_pooling2
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] intermediate_conv_pw_6_relu (De (None, 101)          13029       12928     global_average_pooling2
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] intermediate_conv_pw_7_relu (De (None, 101)          13029       12928     global_average_pooling2
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] intermediate_conv_pw_8_relu (De (None, 101)          13029       12928     global_average_pooling2
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] intermediate_conv_pw_9_relu (De (None, 101)          13029       12928     global_average_pooling2
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] intermediate_conv_pw_10_relu (D (None, 101)          13029       12928     global_average_pooling2
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] intermediate_conv_pw_11_relu (D (None, 101)          13029       12928     global_average_pooling2
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] intermediate_conv_pw_12_relu (D (None, 101)          25957       25856     global_average_pooling2
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] intermediate_conv_pw_13_relu (D (None, 101)          25957       25856     global_average_pooling2
[18.02.2018 17:04:10] __________________________________________________________________________________________________
[18.02.2018 17:04:10] final_output (Dense)            (None, 101)          1267045     1266944   flatten_1[0][0]        
[18.02.2018 17:04:10] ==================================================================================================
[18.02.2018 17:04:10] Total params: 1,637,190
[18.02.2018 17:04:10] Trainable params: 1,418,646
[18.02.2018 17:04:10] Non-trainable params: 218,544
[18.02.2018 17:04:10] Total floating point operations: 37,845,008
[18.02.2018 17:04:10] __________________________________________________________________________________________________

