[09.02.2018 14:45:30] Model summary:
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] Layer (type)                    Output Shape         Param #     Ops #     Connected to           
[09.02.2018 14:45:30] ==================================================================================================
[09.02.2018 14:45:30] input_1 (InputLayer)            (None, 224, 224, 3)  0           None                             
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv1 (Conv2D)                  (None, 112, 112, 32) 864         10838016  input_1[0][0]          
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv1_bn (BatchNormalization)   (None, 112, 112, 32) 128         None      conv1[0][0]            
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv1_relu (Activation)         (None, 112, 112, 32) 0           None      conv1_bn[0][0]         
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_1 (DepthwiseConv2D)     (None, 112, 112, 32) 288         None      conv1_relu[0][0]       
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_1_bn (BatchNormalizatio (None, 112, 112, 32) 128         None      conv_dw_1[0][0]        
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_1_relu (Activation)     (None, 112, 112, 32) 0           None      conv_dw_1_bn[0][0]     
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_1 (Conv2D)              (None, 112, 112, 64) 2048        25690112  conv_dw_1_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_1_bn (BatchNormalizatio (None, 112, 112, 64) 256         None      conv_pw_1[0][0]        
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_1_relu (Activation)     (None, 112, 112, 64) 0           None      conv_pw_1_bn[0][0]     
[09.02.2018 14:45:30] __________________________________________________________________________________________________


[09.02.2018 14:45:30] conv_dw_2 (DepthwiseConv2D)     (None, 56, 56, 64)   576         None      conv_pw_1_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_2_bn (BatchNormalizatio (None, 56, 56, 64)   256         None      conv_dw_2[0][0]        
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_2_relu (Activation)     (None, 56, 56, 64)   0           None      conv_dw_2_bn[0][0]     
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_2 (Conv2D)              (None, 56, 56, 128)  8192        25690112  conv_dw_2_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_2_bn (BatchNormalizatio (None, 56, 56, 128)  512         None      conv_pw_2[0][0]        
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_2_relu (Activation)     (None, 56, 56, 128)  0           None      conv_pw_2_bn[0][0]     
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_3 (DepthwiseConv2D)     (None, 56, 56, 128)  1152        None      conv_pw_2_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________


[09.02.2018 14:45:30] conv_dw_3_bn (BatchNormalizatio (None, 56, 56, 128)  512         None      conv_dw_3[0][0]        
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_3_relu (Activation)     (None, 56, 56, 128)  0           None      conv_dw_3_bn[0][0]     
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_3 (Conv2D)              (None, 56, 56, 128)  16384       51380224  conv_dw_3_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_3_bn (BatchNormalizatio (None, 56, 56, 128)  512         None      conv_pw_3[0][0]        
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_3_relu (Activation)     (None, 56, 56, 128)  0           None      conv_pw_3_bn[0][0]     
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_4 (DepthwiseConv2D)     (None, 28, 28, 128)  1152        None      conv_pw_3_relu[0][0]   


[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_4_bn (BatchNormalizatio (None, 28, 28, 128)  512         None      conv_dw_4[0][0]        
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_4_relu (Activation)     (None, 28, 28, 128)  0           None      conv_dw_4_bn[0][0]     
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_4 (Conv2D)              (None, 28, 28, 256)  32768       25690112  conv_dw_4_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_4_bn (BatchNormalizatio (None, 28, 28, 256)  1024        None      conv_pw_4[0][0]        
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_4_relu (Activation)     (None, 28, 28, 256)  0           None      conv_pw_4_bn[0][0]     
[09.02.2018 14:45:30] __________________________________________________________________________________________________


[09.02.2018 14:45:30] conv_dw_5 (DepthwiseConv2D)     (None, 28, 28, 256)  2304        None      conv_pw_4_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_5_bn (BatchNormalizatio (None, 28, 28, 256)  1024        None      conv_dw_5[0][0]        
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_5_relu (Activation)     (None, 28, 28, 256)  0           None      conv_dw_5_bn[0][0]     
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_5 (Conv2D)              (None, 28, 28, 256)  65536       51380224  conv_dw_5_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_5_bn (BatchNormalizatio (None, 28, 28, 256)  1024        None      conv_pw_5[0][0]        
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_5_relu (Activation)     (None, 28, 28, 256)  0           None      conv_pw_5_bn[0][0]     
[09.02.2018 14:45:30] __________________________________________________________________________________________________


[09.02.2018 14:45:30] conv_dw_6 (DepthwiseConv2D)     (None, 14, 14, 256)  2304        None      conv_pw_5_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_6_bn (BatchNormalizatio (None, 14, 14, 256)  1024        None      conv_dw_6[0][0]        
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_6_relu (Activation)     (None, 14, 14, 256)  0           None      conv_dw_6_bn[0][0]     
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_6 (Conv2D)              (None, 14, 14, 512)  131072      25690112  conv_dw_6_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_6_bn (BatchNormalizatio (None, 14, 14, 512)  2048        None      conv_pw_6[0][0]        
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_6_relu (Activation)     (None, 14, 14, 512)  0           None      conv_pw_6_bn[0][0]     
[09.02.2018 14:45:30] __________________________________________________________________________________________________


[09.02.2018 14:45:30] conv_dw_7 (DepthwiseConv2D)     (None, 14, 14, 512)  4608        None      conv_pw_6_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_7_bn (BatchNormalizatio (None, 14, 14, 512)  2048        None      conv_dw_7[0][0]        
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_7_relu (Activation)     (None, 14, 14, 512)  0           None      conv_dw_7_bn[0][0]     
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_7 (Conv2D)              (None, 14, 14, 512)  262144      51380224  conv_dw_7_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_7_bn (BatchNormalizatio (None, 14, 14, 512)  2048        None      conv_pw_7[0][0]        
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_7_relu (Activation)     (None, 14, 14, 512)  0           None      conv_pw_7_bn[0][0]     
[09.02.2018 14:45:30] __________________________________________________________________________________________________


[09.02.2018 14:45:30] conv_dw_8 (DepthwiseConv2D)     (None, 14, 14, 512)  4608        None      conv_pw_7_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_8_bn (BatchNormalizatio (None, 14, 14, 512)  2048        None      conv_dw_8[0][0]        
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_8_relu (Activation)     (None, 14, 14, 512)  0           None      conv_dw_8_bn[0][0]     
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_8 (Conv2D)              (None, 14, 14, 512)  262144      51380224  conv_dw_8_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_8_bn (BatchNormalizatio (None, 14, 14, 512)  2048        None      conv_pw_8[0][0]        
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_8_relu (Activation)     (None, 14, 14, 512)  0           None      conv_pw_8_bn[0][0]     


[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_9 (DepthwiseConv2D)     (None, 14, 14, 512)  4608        None      conv_pw_8_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_9_bn (BatchNormalizatio (None, 14, 14, 512)  2048        None      conv_dw_9[0][0]        
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_9_relu (Activation)     (None, 14, 14, 512)  0           None      conv_dw_9_bn[0][0]     
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_9 (Conv2D)              (None, 14, 14, 512)  262144      51380224  conv_dw_9_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_9_bn (BatchNormalizatio (None, 14, 14, 512)  2048        None      conv_pw_9[0][0]        
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_9_relu (Activation)     (None, 14, 14, 512)  0           None      conv_pw_9_bn[0][0]     
[09.02.2018 14:45:30] __________________________________________________________________________________________________


[09.02.2018 14:45:30] conv_dw_10 (DepthwiseConv2D)    (None, 14, 14, 512)  4608        None      conv_pw_9_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_10_bn (BatchNormalizati (None, 14, 14, 512)  2048        None      conv_dw_10[0][0]       
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_10_relu (Activation)    (None, 14, 14, 512)  0           None      conv_dw_10_bn[0][0]    
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_10 (Conv2D)             (None, 14, 14, 512)  262144      51380224  conv_dw_10_relu[0][0]  
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_10_bn (BatchNormalizati (None, 14, 14, 512)  2048        None      conv_pw_10[0][0]       
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_10_relu (Activation)    (None, 14, 14, 512)  0           None      conv_pw_10_bn[0][0]    
[09.02.2018 14:45:30] __________________________________________________________________________________________________


[09.02.2018 14:45:30] conv_dw_11 (DepthwiseConv2D)    (None, 14, 14, 512)  4608        None      conv_pw_10_relu[0][0]  
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_11_bn (BatchNormalizati (None, 14, 14, 512)  2048        None      conv_dw_11[0][0]       
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_11_relu (Activation)    (None, 14, 14, 512)  0           None      conv_dw_11_bn[0][0]    
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_11 (Conv2D)             (None, 14, 14, 512)  262144      51380224  conv_dw_11_relu[0][0]  
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_11_bn (BatchNormalizati (None, 14, 14, 512)  2048        None      conv_pw_11[0][0]       
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_11_relu (Activation)    (None, 14, 14, 512)  0           None      conv_pw_11_bn[0][0]    
[09.02.2018 14:45:30] __________________________________________________________________________________________________


[09.02.2018 14:45:30] conv_dw_12 (DepthwiseConv2D)    (None, 7, 7, 512)    4608        None      conv_pw_11_relu[0][0]  
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_12_bn (BatchNormalizati (None, 7, 7, 512)    2048        None      conv_dw_12[0][0]       
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_12_relu (Activation)    (None, 7, 7, 512)    0           None      conv_dw_12_bn[0][0]    
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_12 (Conv2D)             (None, 7, 7, 1024)   524288      25690112  conv_dw_12_relu[0][0]  
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_12_bn (BatchNormalizati (None, 7, 7, 1024)   4096        None      conv_pw_12[0][0]       
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_12_relu (Activation)    (None, 7, 7, 1024)   0           None      conv_pw_12_bn[0][0]    
[09.02.2018 14:45:30] __________________________________________________________________________________________________

[09.02.2018 14:45:30] conv_dw_13 (DepthwiseConv2D)    (None, 7, 7, 1024)   9216        None      conv_pw_12_relu[0][0]  
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_13_bn (BatchNormalizati (None, 7, 7, 1024)   4096        None      conv_dw_13[0][0]       
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_dw_13_relu (Activation)    (None, 7, 7, 1024)   0           None      conv_dw_13_bn[0][0]    
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_13 (Conv2D)             (None, 7, 7, 1024)   1048576     51380224  conv_dw_13_relu[0][0]  
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_13_bn (BatchNormalizati (None, 7, 7, 1024)   4096        None      conv_pw_13[0][0]       
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] conv_pw_13_relu (Activation)    (None, 7, 7, 1024)   0           None      conv_pw_13_bn[0][0]    


[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] global_average_pooling2d_1 (Glo (None, 64)           0           None      conv_pw_1_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] global_average_pooling2d_2 (Glo (None, 128)          0           None      conv_pw_2_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] global_average_pooling2d_3 (Glo (None, 128)          0           None      conv_pw_3_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] global_average_pooling2d_4 (Glo (None, 256)          0           None      conv_pw_4_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] global_average_pooling2d_5 (Glo (None, 256)          0           None      conv_pw_5_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] global_average_pooling2d_6 (Glo (None, 512)          0           None      conv_pw_6_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] global_average_pooling2d_7 (Glo (None, 512)          0           None      conv_pw_7_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] global_average_pooling2d_8 (Glo (None, 512)          0           None      conv_pw_8_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] global_average_pooling2d_9 (Glo (None, 512)          0           None      conv_pw_9_relu[0][0]   
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] global_average_pooling2d_10 (Gl (None, 512)          0           None      conv_pw_10_relu[0][0]  
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] global_average_pooling2d_11 (Gl (None, 512)          0           None      conv_pw_11_relu[0][0]  
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] global_average_pooling2d_12 (Gl (None, 1024)         0           None      conv_pw_12_relu[0][0]  
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] global_average_pooling2d_13 (Gl (None, 1024)         0           None      conv_pw_13_relu[0][0]  
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] flatten_1 (Flatten)             (None, 50176)        0           None      conv_pw_13_relu[0][0]  
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] intermediate_conv_pw_1_relu (De (None, 101)          6565        6464      global_average_pooling2
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] intermediate_conv_pw_2_relu (De (None, 101)          13029       12928     global_average_pooling2
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] intermediate_conv_pw_3_relu (De (None, 101)          13029       12928     global_average_pooling2
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] intermediate_conv_pw_4_relu (De (None, 101)          25957       25856     global_average_pooling2
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] intermediate_conv_pw_5_relu (De (None, 101)          25957       25856     global_average_pooling2
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] intermediate_conv_pw_6_relu (De (None, 101)          51813       51712     global_average_pooling2
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] intermediate_conv_pw_7_relu (De (None, 101)          51813       51712     global_average_pooling2
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] intermediate_conv_pw_8_relu (De (None, 101)          51813       51712     global_average_pooling2
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] intermediate_conv_pw_9_relu (De (None, 101)          51813       51712     global_average_pooling2
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] intermediate_conv_pw_10_relu (D (None, 101)          51813       51712     global_average_pooling2
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] intermediate_conv_pw_11_relu (D (None, 101)          51813       51712     global_average_pooling2
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] intermediate_conv_pw_12_relu (D (None, 101)          103525      103424    global_average_pooling2
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] intermediate_conv_pw_13_relu (D (None, 101)          103525      103424    global_average_pooling2
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30] final_output (Dense)            (None, 101)          5067877     5067776   flatten_1[0][0]        
[09.02.2018 14:45:30] ==================================================================================================
[09.02.2018 14:45:30] Total params: 8,899,206
[09.02.2018 14:45:30] Trainable params: 5,670,342
[09.02.2018 14:45:30] Non-trainable params: 3,228,864
[09.02.2018 14:45:30] Total floating point operations: 555,999,296
[09.02.2018 14:45:30] __________________________________________________________________________________________________
[09.02.2018 14:45:30]
