yue@yue:~/tool/keras$ python /media/yue/e7036176-287c-4b18-9609-9811b8e33769/ElasticNN/FLOPS/VGG16.py Using TensorFlow backend.
[09.02.2018 15:23:16] Training starts...
[09.02.2018 15:23:17] Model summary:
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] Layer (type)                    Output Shape         Param #     Ops #     Connected to           
[09.02.2018 15:23:17] ==================================================================================================
[09.02.2018 15:23:17] input_1 (InputLayer)            (None, 224, 224, 3)  0           None                             
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] block1_conv1 (Conv2D)           (None, 224, 224, 64) 1792        86704128  input_1[0][0]          
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] block1_conv2 (Conv2D)           (None, 224, 224, 64) 36928       184968806 block1_conv1[0][0]     
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] block1_pool (MaxPooling2D)      (None, 112, 112, 64) 0           None      block1_conv2[0][0]     
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] block2_conv1 (Conv2D)           (None, 112, 112, 128 73856       924844032 block1_pool[0][0]      
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] block2_conv2 (Conv2D)           (None, 112, 112, 128 147584      184968806 block2_conv1[0][0]     
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] block2_pool (MaxPooling2D)      (None, 56, 56, 128)  0           None      block2_conv2[0][0]     
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] block3_conv1 (Conv2D)           (None, 56, 56, 256)  295168      924844032 block2_pool[0][0]      
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] block3_conv2 (Conv2D)           (None, 56, 56, 256)  590080      184968806 block3_conv1[0][0]     
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] block3_conv3 (Conv2D)           (None, 56, 56, 256)  590080      184968806 block3_conv2[0][0]     
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] block3_pool (MaxPooling2D)      (None, 28, 28, 256)  0           None      block3_conv3[0][0]     
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] block4_conv1 (Conv2D)           (None, 28, 28, 512)  1180160     924844032 block3_pool[0][0]      
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] block4_conv2 (Conv2D)           (None, 28, 28, 512)  2359808     184968806 block4_conv1[0][0]     
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] block4_conv3 (Conv2D)           (None, 28, 28, 512)  2359808     184968806 block4_conv2[0][0]     
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] block4_pool (MaxPooling2D)      (None, 14, 14, 512)  0           None      block4_conv3[0][0]     
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] block5_conv1 (Conv2D)           (None, 14, 14, 512)  2359808     462422016 block4_pool[0][0]      
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] block5_conv2 (Conv2D)           (None, 14, 14, 512)  2359808     462422016 block5_conv1[0][0]     
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] block5_conv3 (Conv2D)           (None, 14, 14, 512)  2359808     462422016 block5_conv2[0][0]     
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] block5_pool (MaxPooling2D)      (None, 7, 7, 512)    0           None      block5_conv3[0][0]     
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] global_average_pooling2d_1 (Glo (None, 64)           0           None      block1_pool[0][0]      
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] global_average_pooling2d_2 (Glo (None, 128)          0           None      block2_pool[0][0]      
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] global_average_pooling2d_3 (Glo (None, 256)          0           None      block3_pool[0][0]      
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] global_average_pooling2d_4 (Glo (None, 512)          0           None      block4_pool[0][0]      
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] global_average_pooling2d_5 (Glo (None, 512)          0           None      block5_pool[0][0]      
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] flatten_1 (Flatten)             (None, 25088)        0           None      block5_pool[0][0]      
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] intermediate_block1_pool (Dense (None, 101)          6565        6464      global_average_pooling2
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] intermediate_block2_pool (Dense (None, 101)          13029       12928     global_average_pooling2
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] intermediate_block3_pool (Dense (None, 101)          25957       25856     global_average_pooling2
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] intermediate_block4_pool (Dense (None, 101)          51813       51712     global_average_pooling2
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] intermediate_block5_pool (Dense (None, 101)          51813       51712     global_average_pooling2
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17] final_output (Dense)            (None, 101)          2533989     2533888   flatten_1[0][0]        
[09.02.2018 15:23:17] ==================================================================================================
[09.02.2018 15:23:17] Total params: 17,397,854
[09.02.2018 15:23:17] Trainable params: 17,397,854
[09.02.2018 15:23:17] Non-trainable params: 0
[09.02.2018 15:23:17] Total floating point operations: 15,349,313,216
[09.02.2018 15:23:17] __________________________________________________________________________________________________
[09.02.2018 15:23:17]
