[08.06.2018 11:25:40] Model summary:
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] Layer (type)                                     Output Shape                     Param #           Ops #          Connected to                       
[08.06.2018 11:25:40] ======================================================================================================================================================
[08.06.2018 11:25:40] input_1 (InputLayer)                             (None, 32, 32, 3)                0                 None                                              
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] conv2d_1 (Conv2D)                                (None, 16, 16, 64)               9472              2408448        input_1[0][0]                      
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] batch_normalization_1 (BatchNormalization)       (None, 16, 16, 64)               256               None           conv2d_1[0][0]                     
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] activation_1 (Activation)                        (None, 16, 16, 64)               0                 None           batch_normalization_1[0][0]        
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] max_pooling2d_1 (MaxPooling2D)                   (None, 8, 8, 64)                 0                 None           activation_1[0][0]                 
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] conv2d_2 (Conv2D)                                (None, 8, 8, 64)                 36928             2359296        max_pooling2d_1[0][0]              
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] batch_normalization_2 (BatchNormalization)       (None, 8, 8, 64)                 256               None           conv2d_2[0][0]                     
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] activation_2 (Activation)                        (None, 8, 8, 64)                 0                 None           batch_normalization_2[0][0]        
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] conv2d_3 (Conv2D)                                (None, 8, 8, 64)                 36928             2359296        activation_2[0][0]                 
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] add_1 (Add)                                      (None, 8, 8, 64)                 0                 None           max_pooling2d_1[0][0]              
[08.06.2018 11:25:40]                                                                                                     conv2d_3[0][0] 
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] batch_normalization_3 (BatchNormalization)       (None, 8, 8, 64)                 256               None           add_1[0][0]                        
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] activation_3 (Activation)                        (None, 8, 8, 64)                 0                 None           batch_normalization_3[0][0]        
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] conv2d_4 (Conv2D)                                (None, 8, 8, 64)                 36928             2359296        activation_3[0][0]                 
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] batch_normalization_4 (BatchNormalization)       (None, 8, 8, 64)                 256               None           conv2d_4[0][0]                     
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] activation_4 (Activation)                        (None, 8, 8, 64)                 0                 None           batch_normalization_4[0][0]        
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] conv2d_5 (Conv2D)                                (None, 8, 8, 64)                 36928             2359296        activation_4[0][0]                 
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] add_2 (Add)                                      (None, 8, 8, 64)                 0                 None           add_1[0][0]                        
[08.06.2018 11:25:40]                                                                                                     conv2d_5[0][0] 
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] batch_normalization_5 (BatchNormalization)       (None, 8, 8, 64)                 256               None           add_2[0][0]                        
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] activation_5 (Activation)                        (None, 8, 8, 64)                 0                 None           batch_normalization_5[0][0]        
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] conv2d_6 (Conv2D)                                (None, 4, 4, 128)                73856             1179648        activation_5[0][0]                 
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] batch_normalization_6 (BatchNormalization)       (None, 4, 4, 128)                512               None           conv2d_6[0][0]                     
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] activation_6 (Activation)                        (None, 4, 4, 128)                0                 None           batch_normalization_6[0][0]        
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] conv2d_8 (Conv2D)                                (None, 4, 4, 128)                8320              131072         add_2[0][0]                        
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] conv2d_7 (Conv2D)                                (None, 4, 4, 128)                147584            2359296        activation_6[0][0]                 
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] add_3 (Add)                                      (None, 4, 4, 128)                0                 None           conv2d_8[0][0]                     
[08.06.2018 11:25:40]                                                                                                     conv2d_7[0][0] 
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] batch_normalization_7 (BatchNormalization)       (None, 4, 4, 128)                512               None           add_3[0][0]                        
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] activation_7 (Activation)                        (None, 4, 4, 128)                0                 None           batch_normalization_7[0][0]        
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] conv2d_9 (Conv2D)                                (None, 4, 4, 128)                147584            2359296        activation_7[0][0]                 
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] batch_normalization_8 (BatchNormalization)       (None, 4, 4, 128)                512               None           conv2d_9[0][0]                     
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] activation_8 (Activation)                        (None, 4, 4, 128)                0                 None           batch_normalization_8[0][0]        
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] conv2d_10 (Conv2D)                               (None, 4, 4, 128)                147584            2359296        activation_8[0][0]                 
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] add_4 (Add)                                      (None, 4, 4, 128)                0                 None           add_3[0][0]                        
[08.06.2018 11:25:40]                                                                                                     conv2d_10[0][0]
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] batch_normalization_9 (BatchNormalization)       (None, 4, 4, 128)                512               None           add_4[0][0]                        
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] activation_9 (Activation)                        (None, 4, 4, 128)                0                 None           batch_normalization_9[0][0]        
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] conv2d_11 (Conv2D)                               (None, 2, 2, 256)                295168            1179648        activation_9[0][0]                 
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] batch_normalization_10 (BatchNormalization)      (None, 2, 2, 256)                1024              None           conv2d_11[0][0]                    
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] activation_10 (Activation)                       (None, 2, 2, 256)                0                 None           batch_normalization_10[0][0]       
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] conv2d_13 (Conv2D)                               (None, 2, 2, 256)                33024             131072         add_4[0][0]                        
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] conv2d_12 (Conv2D)                               (None, 2, 2, 256)                590080            2359296        activation_10[0][0]                
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] add_5 (Add)                                      (None, 2, 2, 256)                0                 None           conv2d_13[0][0]                    
[08.06.2018 11:25:40]                                                                                                     conv2d_12[0][0]
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] batch_normalization_11 (BatchNormalization)      (None, 2, 2, 256)                1024              None           add_5[0][0]                        
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] activation_11 (Activation)                       (None, 2, 2, 256)                0                 None           batch_normalization_11[0][0]       
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] conv2d_14 (Conv2D)                               (None, 2, 2, 256)                590080            2359296        activation_11[0][0]                
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] batch_normalization_12 (BatchNormalization)      (None, 2, 2, 256)                1024              None           conv2d_14[0][0]                    
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] activation_12 (Activation)                       (None, 2, 2, 256)                0                 None           batch_normalization_12[0][0]       
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] conv2d_15 (Conv2D)                               (None, 2, 2, 256)                590080            2359296        activation_12[0][0]                
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] add_6 (Add)                                      (None, 2, 2, 256)                0                 None           add_5[0][0]                        
[08.06.2018 11:25:40]                                                                                                     conv2d_15[0][0]
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] batch_normalization_13 (BatchNormalization)      (None, 2, 2, 256)                1024              None           add_6[0][0]                        
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] activation_13 (Activation)                       (None, 2, 2, 256)                0                 None           batch_normalization_13[0][0]       
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] conv2d_16 (Conv2D)                               (None, 1, 1, 512)                1180160           1179648        activation_13[0][0]                
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] batch_normalization_14 (BatchNormalization)      (None, 1, 1, 512)                2048              None           conv2d_16[0][0]                    
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] activation_14 (Activation)                       (None, 1, 1, 512)                0                 None           batch_normalization_14[0][0]       
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] conv2d_18 (Conv2D)                               (None, 1, 1, 512)                131584            131072         add_6[0][0]                        
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] conv2d_17 (Conv2D)                               (None, 1, 1, 512)                2359808           2359296        activation_14[0][0]                
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] add_7 (Add)                                      (None, 1, 1, 512)                0                 None           conv2d_18[0][0]                    
[08.06.2018 11:25:40]                                                                                                     conv2d_17[0][0]
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] batch_normalization_15 (BatchNormalization)      (None, 1, 1, 512)                2048              None           add_7[0][0]                        
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] activation_15 (Activation)                       (None, 1, 1, 512)                0                 None           batch_normalization_15[0][0]       
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] conv2d_19 (Conv2D)                               (None, 1, 1, 512)                2359808           2359296        activation_15[0][0]                
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] batch_normalization_16 (BatchNormalization)      (None, 1, 1, 512)                2048              None           conv2d_19[0][0]                    
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] activation_16 (Activation)                       (None, 1, 1, 512)                0                 None           batch_normalization_16[0][0]       
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] conv2d_20 (Conv2D)                               (None, 1, 1, 512)                2359808           2359296        activation_16[0][0]                
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] add_8 (Add)                                      (None, 1, 1, 512)                0                 None           add_7[0][0]                        
[08.06.2018 11:25:40]                                                                                                     conv2d_20[0][0]
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] batch_normalization_17 (BatchNormalization)      (None, 1, 1, 512)                2048              None           add_8[0][0]                        
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] activation_17 (Activation)                       (None, 1, 1, 512)                0                 None           batch_normalization_17[0][0]       
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] average_pooling2d_1 (AveragePooling2D)           (None, 1, 1, 512)                0                 None           activation_17[0][0]                
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] flatten_1 (Flatten)                              (None, 512)                      0                 None           average_pooling2d_1[0][0]          
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] dense_1 (Dense)                                  (None, 10)                       5130              5120           flatten_1[0][0]                    
[08.06.2018 11:25:40] ======================================================================================================================================================
[08.06.2018 11:25:40] Total params: 11,192,458
[08.06.2018 11:25:40] Trainable params: 11,184,650
[08.06.2018 11:25:40] Non-trainable params: 7,808
[08.06.2018 11:25:40] Total floating point operations: 37,016,576
[08.06.2018 11:25:40] ______________________________________________________________________________________________________________________________________________________
[08.06.2018 11:25:40] 
